tutorials/lesInterFoam/nozzleFlow2D/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          turbulenceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESmodel        oneEqEddy;

delta           smooth;

laminarCoeffs
{
}

oneEqEddyCoeffs
{
    ck              ck [0 0 0 0 0 0 0] 0.07;
    ce              ce [0 0 0 0 0 0 0] 1.05;
}

dynOneEqEddyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    filter          simple;
}

locDynOneEqEddyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    filter          simple;
}

SmagorinskyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    ck              ck [0 0 0 0 0 0 0] 0.07;
}

Smagorinsky2Coeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    ck              ck [0 0 0 0 0 0 0] 0.07;
    cD2             cD2 [0 1 0 0 0 0 0] 0.02;
}

spectEddyViscCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    cB              cB [0 0 0 0 0 0 0] 8.22;
    cK1             cK1 [0 0 0 0 0 0 0] 0.83;
    cK2             cK2 [0 0 0 0 0 0 0] 1.03;
    cK3             cK3 [0 0 0 0 0 0 0] 4.75;
    cK4             cK4 [0 0 0 0 0 0 0] 2.55;
}

dynSmagorinskyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    filter          simple;
}

mixedSmagorinskyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    ck              ck [0 0 0 0 0 0 0] 0.07;
    filter          simple;
}

dynMixedSmagorinskyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    filter          simple;
}

LRRDiffStressCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    ck              ck [0 0 0 0 0 0 0] 0.09;
    c1              c1 [0 0 0 0 0 0 0] 1.8;
    c2              c2 [0 0 0 0 0 0 0] 0.6;
}

DeardorffDiffStressCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    ck              ck [0 0 0 0 0 0 0] 0.09;
    cm              cm [0 0 0 0 0 0 0] 4.13;
}

SpalartAllmarasCoeffs
{
    alphaNut        alphaNut [0 0 0 0 0 0 0] 1.5;
    Cb1             Cb1 [0 0 0 0 0 0 0] 0.1355;
    Cb2             Cb2 [0 0 0 0 0 0 0] 0.622;
    Cw2             Cw2 [0 0 0 0 0 0 0] 0.3;
    Cw3             Cw3 [0 0 0 0 0 0 0] 2;
    Cv1             Cv1 [0 0 0 0 0 0 0] 7.1;
    Cv2             Cv2 [0 0 0 0 0 0 0] 5.0;
    CDES            CDES [0 0 0 0 0 0 0] 0.65;
    ck              ck [0 0 0 0 0 0 0] 0.07;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

PrandtlCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Cdelta          Cdelta [0 0 0 0 0 0 0] 0.158;
}

vanDriestCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Aplus           Aplus [0 0 0 0 0 0 0] 26;
    Cdelta          Cdelta [0 0 0 0 0 0 0] 0.158;
}

smoothCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    maxDeltaRatio   1.1;
}

kappa           kappa [0 0 0 0 0 0 0] 0.4187;

wallFunctionCoeffs
{
    E               E [0 0 0 0 0 0 0] 9;
}


// ************************************************************************* //
